In [1]:
 import mysql.connector

In [2]:
mydb=mysql.connector.connect(host="localhost",user="venky88an", password="1234")

In [3]:
mycursor=mydb.cursor()

In [4]:
mycursor.execute("show databases")

In [5]:
for i in mycursor:
    print(i)

('elusko',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sales',)
('sys',)
('telusko',)
('venkatesan',)
('world',)

In [6]:
mydb=mysql.connector.connect(host="localhost",user="venky88an", password="1234", database="telusko")

In [7]:
mycursor=mydb.cursor()

In [9]:
mycursor.execute("select * from student1")

In [10]:
result=mycursor.fetchone()

In [11]:
for i in result:
    print(i)

navin
vsit

# For creating table using SQL in python,Also we can view the update in mySQL workbench

In [75]:
mydb=mysql.connector.connect(host="localhost",user="venky88an", password="1234", database="telusko")

In [76]:
mycursor=mydb.cursor()

In [45]:
mycursor.execute("CREATE TABLE Person1 (name VARCHAR(50), age smallint UNSIGNED, personID int PRIMARY KEY AUTO_INCREMENT)")

In [47]:
mycursor.execute("DESCRIBE Person1")

In [48]:
for i in mycursor:
    print(i)

('name', b'varchar(50)', 'YES', '', None, '')
('age', b'smallint unsigned', 'YES', '', None, '')
('personID', b'int', 'NO', 'PRI', None, 'auto_increment')

In [56]:
mycursor.execute("INSERT INTO Person1 (name,age) VALUES (%s,%s)",("pinky",30))

# this is must while doing insert function

In [57]:
mydb.commit() # this is must while doing insert function

In [69]:
mycursor.execute("select * from Person1")

In [63]:
for i in mycursor:
    print(i)

('venky', 32, 1)
('pinky', 30, 2)

# Fetching the table values

In [48]:
mydb=mysql.connector.connect(host="localhost",user="venky88an", password="1234", database="telusko")

In [49]:
mycursor=mydb.cursor()

In [50]:
mycursor.execute("select * from Person1")

In [51]:
#result=mycursor.fetchone()
result=mycursor.fetchall() # to fetch all values

In [52]:
for i in result:
    print(i)

('venky', 32, 1)
('pinky', 30, 2)

# Creating databases

In [92]:
mydb=mysql.connector.connect(host="localhost",user="venky88an", password="1234")

In [93]:
mycursor=mydb.cursor()

# # Created can be checked in the mysql workbench

In [94]:
mycursor.execute("CREATE DATABASE Venkatesan") # created can be checked in the mysql workbench

# Use the created table in the created database and others  by considering the below commands

In [5]:
mydb=mysql.connector.connect(host="localhost",user="venky88an", password="1234", database="venkatesan")

In [6]:
mycursor=mydb.cursor()

In [111]:
mycursor.execute("CREATE TABLE Scientist (name VARCHAR(50), age smallint UNSIGNED, personID int PRIMARY KEY AUTO_INCREMENT)")

# we can insert the data here into the table as required

In [112]:
mycursor.execute("INSERT INTO Scientist  (name,age) VALUES (%s,%s)",("venky",30)) # we can insert the data here into the table as required

In [113]:
mydb.commit() # this is must while doing insert function

In [17]:
mycursor.execute("select * from Scientist") # if you want to read you have once again connect with database(venkatesan)

In [18]:
for i in mycursor:
    print(i)

('venky', 30, 1)

# Selecting data and altering tables

In [54]:
mydb=mysql.connector.connect(host="localhost",user="venky88an", password="1234", database="venkatesan")

In [55]:
mycursor=mydb.cursor()

# I have created new test1 due to error but we can use Test table from select *

In [76]:
mycursor.execute("CREATE TABLE Test1 (name varchar(50) NOT NULL, created datetime NOT NULL, gender ENUM('M','F','O') NOT NULL, id int PRIMARY KEY NOT NULL AUTO_INCREMENT)")

In [11]:
from datetime import datetime

In [12]:
mycursor.execute("INSERT INTO Test1 (name, created, gender) VALUES (%s,%s,%s)",("ILA",datetime.now(),"F")) # we can insert here

# This is must while doing insert function

In [84]:
mydb.commit() # this is must while doing insert function

# We are fetching added food column data here but dropping the food column may hang the notebook

In [16]:
mycursor.execute("select * from Test")

In [17]:
result=mycursor.fetchall()

In [18]:
for i in result:
    print(i)

('TIM', datetime.datetime(2020, 8, 14, 21, 25, 44), 'M', 1, '')
('VENK', datetime.datetime(2020, 8, 14, 21, 26, 3), 'M', 2, '')
('PINK', datetime.datetime(2020, 8, 14, 21, 26, 19), 'F', 3, '')
('PINKY', datetime.datetime(2020, 8, 14, 21, 26, 31), 'F', 4, '')
('VENKAT', datetime.datetime(2020, 8, 14, 21, 26, 42), 'M', 5, '')

# using where with some conditions

In [19]:
mycursor.execute("select * from Test WHERE gender = 'M'")

In [20]:
for i in mycursor:
    print(i)

('TIM', datetime.datetime(2020, 8, 14, 21, 25, 44), 'M', 1, '')
('VENK', datetime.datetime(2020, 8, 14, 21, 26, 3), 'M', 2, '')
('VENKAT', datetime.datetime(2020, 8, 14, 21, 26, 42), 'M', 5, '')

In [21]:
mycursor.execute("select * from Test WHERE gender = 'F'")

In [22]:
for i in mycursor:
    print(i)

('PINK', datetime.datetime(2020, 8, 14, 21, 26, 19), 'F', 3, '')
('PINKY', datetime.datetime(2020, 8, 14, 21, 26, 31), 'F', 4, '')

# using where conditions as well as only id and name

In [23]:
mycursor.execute("select id, name from Test WHERE gender = 'F'") # with

In [24]:
for i in mycursor:
    print(i)

(3, 'PINK')
(4, 'PINKY')

In [25]:
mycursor.execute("select id, name from Test WHERE gender = 'M'")

In [26]:
for i in mycursor:
    print(i)

(1, 'TIM')
(2, 'VENK')
(5, 'VENKAT')

# Using orderby functionalities like ascending and descending, id is the reference

In [27]:
mycursor.execute("select * from Test WHERE gender = 'M' ORDER BY id DESC")

In [28]:
for i in mycursor:
    print(i)

('VENKAT', datetime.datetime(2020, 8, 14, 21, 26, 42), 'M', 5, '')
('VENK', datetime.datetime(2020, 8, 14, 21, 26, 3), 'M', 2, '')
('TIM', datetime.datetime(2020, 8, 14, 21, 25, 44), 'M', 1, '')

In [29]:
mycursor.execute("select * from Test WHERE gender = 'M' ORDER BY id ASC")

In [30]:
for i in mycursor:
    print(i)

('TIM', datetime.datetime(2020, 8, 14, 21, 25, 44), 'M', 1, '')
('VENK', datetime.datetime(2020, 8, 14, 21, 26, 3), 'M', 2, '')
('VENKAT', datetime.datetime(2020, 8, 14, 21, 26, 42), 'M', 5, '')

# Adding new column named food

# After added the column you should not use this code

In [63]:
mycursor.execute("ALTER TABLE Test ADD COLUMN food varchar(50) NOT NULL" )

In [31]:
mycursor.execute("DESCRIBE Test")

In [32]:
for i in mycursor:
    print(i)

('name', b'varchar(50)', 'NO', '', None, '')
('created', b'datetime', 'NO', '', None, '')
('gender', b"enum('M','F','O')", 'NO', '', None, '')
('id', b'int', 'NO', 'PRI', None, 'auto_increment')
('food', b'varchar(50)', 'NO', '', None, '')

In [33]:
mycursor.execute("select * from Test")

In [34]:
for i in mycursor:
    print(i)

('TIM', datetime.datetime(2020, 8, 14, 21, 25, 44), 'M', 1, '')
('VENK', datetime.datetime(2020, 8, 14, 21, 26, 3), 'M', 2, '')
('PINK', datetime.datetime(2020, 8, 14, 21, 26, 19), 'F', 3, '')
('PINKY', datetime.datetime(2020, 8, 14, 21, 26, 31), 'F', 4, '')
('VENKAT', datetime.datetime(2020, 8, 14, 21, 26, 42), 'M', 5, '')

# Do not run Test1 table dropping food1 related codes (after adding), the notebook may hang due to drop function

In [ ]:
mycursor.execute("INSERT INTO Test1 (name, created, gender) VALUES (%s,%s,%s)",("VENILA",datetime.now(),"F")) # we can insert here

In [105]:
mydb.commit()

# you can insert data here and can see the added data but in sql workbench by commit alone we can see the updated values

In [13]:
mycursor.execute("INSERT INTO Test1 (name, created, gender) VALUES (%s,%s,%s)",("NILA",datetime.now(),"F")) #

In [56]:
mycursor.execute("select * from Test1")

In [57]:
for i in mycursor:
    print(i)

('LOSH', datetime.datetime(2020, 8, 14, 22, 41, 25), 'F', 1)
('TIM', datetime.datetime(2020, 8, 14, 22, 41, 59), 'M', 2)
('VENK', datetime.datetime(2020, 8, 14, 22, 42, 15), 'M', 3)
('PINK', datetime.datetime(2020, 8, 14, 22, 42, 23), 'M', 4)
('PINKY', datetime.datetime(2020, 8, 14, 22, 42, 29), 'M', 5)
('VENILA', datetime.datetime(2020, 8, 14, 22, 43, 18), 'F', 6)
('VENI', datetime.datetime(2020, 8, 14, 23, 46, 13), 'F', 8)
('VNI', datetime.datetime(2020, 8, 14, 23, 47, 9), 'F', 9)
('NI', datetime.datetime(2020, 8, 14, 23, 47, 38), 'F', 10)

# we have to do commit so only it will be reflected in mysql workbench

In [58]:
mydb.commit()

# we can add food1 column and see, but drop may hang the notebook

In [108]:
mycursor.execute("ALTER TABLE Test1 ADD COLUMN food1 varchar(50) NOT NULL" )

In [121]:
mycursor.execute("DESCRIBE Test1")

In [122]:
for i in mycursor:
    print(i)

('name', b'varchar(50)', 'NO', '', None, '')
('created', b'datetime', 'NO', '', None, '')
('gender', b"enum('M','F','O')", 'NO', '', None, '')
('id', b'int', 'NO', 'PRI', None, 'auto_increment')
('food1', b'varchar(50)', 'NO', '', None, '')

# We can change the column name

In [7]:
mycursor.execute("select * from Test1")

In [8]:
for i in mycursor:
    print(i)

('LOSH', datetime.datetime(2020, 8, 14, 22, 41, 25), 'F', 1)
('TIM', datetime.datetime(2020, 8, 14, 22, 41, 59), 'M', 2)
('VENK', datetime.datetime(2020, 8, 14, 22, 42, 15), 'M', 3)
('PINK', datetime.datetime(2020, 8, 14, 22, 42, 23), 'M', 4)
('PINKY', datetime.datetime(2020, 8, 14, 22, 42, 29), 'M', 5)
('VENILA', datetime.datetime(2020, 8, 14, 22, 43, 18), 'F', 6)
('VENI', datetime.datetime(2020, 8, 14, 23, 46, 13), 'F', 8)
('VNI', datetime.datetime(2020, 8, 14, 23, 47, 9), 'F', 9)
('NI', datetime.datetime(2020, 8, 14, 23, 47, 38), 'F', 10)

In [53]:
mycursor.execute("ALTER TABLE Test1 CHANGE name first_name varchar(50)")

In [54]:
mycursor.execute("DESCRIBE Test1")

# here column "name" is changed to "first_name"

In [55]:
for i in mycursor:
    print(i)

('first_name', b'varchar(50)', 'YES', '', None, '')
('created', b'datetime', 'NO', '', None, '')
('gender', b"enum('M','F','O')", 'NO', '', None, '')
('id', b'int', 'NO', 'PRI', None, 'auto_increment')

# ALTER TABLE Code will work if the name (column) is changed to first_name which is done before, but while using CHANGE may hang the notebook when we are doing the change from first_name to name. I want to keep name as itself because most of the code use name, not first_name

In [9]:
mycursor.execute("ALTER TABLE Test1 CHANGE first_name name varchar(50)")

ProgrammingError: 1054 (42S22): Unknown column 'first_name' in 'test1'

In [ ]:
mycursor.execute("DESCRIBE Test1")

In [ ]:
for i in mycursor:
    print(i)

# Simple and effective Extraction of data using sql

In [10]:
mydb=mysql.connector.connect(host="localhost",user="venky88an", password="1234", database="venkatesan")

In [5]:
import pandas as pd

In [13]:
df=pd.read_sql("select * from Test1",con=mydb)

In [14]:
df

     name             created gender  id
0    LOSH 2020-08-14 22:41:25      F   1
1     TIM 2020-08-14 22:41:59      M   2
2    VENK 2020-08-14 22:42:15      M   3
3    PINK 2020-08-14 22:42:23      M   4
4   PINKY 2020-08-14 22:42:29      M   5
5  VENILA 2020-08-14 22:43:18      F   6
6    VENI 2020-08-14 23:46:13      F   8
7     VNI 2020-08-14 23:47:09      F   9
8      NI 2020-08-14 23:47:38      F  10